<!-- terraform-plan-website -->
### Terraform Plan: `website` ✅

<details>
<summary>Show plan output</summary>

```
cloudflare_pages_project.website: Preparing import... [id=2893a9667da2abc314f81440d2513fc5/reinhardt-web]
data.cloudflare_zone.website: Reading...
cloudflare_pages_project.website: Refreshing state... [id=reinhardt-web]
data.cloudflare_zone.website: Read complete after 1s [id=7f483b9c99ee9e16c695471be9036b4f]
cloudflare_dns_record.google_verification: Preparing import... [id=7f483b9c99ee9e16c695471be9036b4f/15661e09e0b73f560a6621168aac41f7]
cloudflare_dns_record.google_verification: Refreshing state... [id=15661e09e0b73f560a6621168aac41f7]
cloudflare_pages_domain.website: Preparing import... [id=2893a9667da2abc314f81440d2513fc5/reinhardt-web/reinhardt-web.dev]
cloudflare_pages_domain.website: Refreshing state... [id=reinhardt-web.dev]
cloudflare_dns_record.website_apex: Preparing import... [id=7f483b9c99ee9e16c695471be9036b4f/c13a4c51c46778e261ed9a9aa568fce0]
cloudflare_dns_record.website_www: Preparing import... [id=7f483b9c99ee9e16c695471be9036b4f/c6328361154e709c5913e151fdaa8393]
cloudflare_dns_record.website_www: Refreshing state... [id=c6328361154e709c5913e151fdaa8393]
cloudflare_dns_record.website_apex: Refreshing state... [id=c13a4c51c46778e261ed9a9aa568fce0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.google_verification will be imported
    resource "cloudflare_dns_record" "google_verification" {
        content     = "google-site-verification=7YYAn6zMbPosaW1o0NPx4j_dqbQXhd4YvkZ7iQ8t__Q"
        created_on  = "2026-02-24T05:43:48Z"
        id          = "15661e09e0b73f560a6621168aac41f7"
        meta        = jsonencode({})
        modified_on = "2026-02-24T06:04:28Z"
        name        = "reinhardt-web.dev"
        proxiable   = false
        proxied     = false
        settings    = {}
        tags        = []
        ttl         = 3600
        type        = "TXT"
        zone_id     = "7f483b9c99ee9e16c695471be9036b4f"
    }

  # cloudflare_dns_record.website_apex will be imported
    resource "cloudflare_dns_record" "website_apex" {
        content     = "reinhardt-web.pages.dev"
        created_on  = "2026-02-24T05:34:51Z"
        id          = "c13a4c51c46778e261ed9a9aa568fce0"
        meta        = jsonencode({})
        modified_on = "2026-02-24T05:34:51Z"
        name        = "reinhardt-web.dev"
        proxiable   = true
        proxied     = true
        settings    = {
            flatten_cname = false
        }
        tags        = []
        ttl         = 1
        type        = "CNAME"
        zone_id     = "7f483b9c99ee9e16c695471be9036b4f"
    }

  # cloudflare_dns_record.website_www will be imported
    resource "cloudflare_dns_record" "website_www" {
        content     = "reinhardt-web.pages.dev"
        created_on  = "2026-02-24T05:34:50Z"
        id          = "c6328361154e709c5913e151fdaa8393"
        meta        = jsonencode({})
        modified_on = "2026-02-24T05:34:50Z"
        name        = "www.reinhardt-web.dev"
        proxiable   = true
        proxied     = true
        settings    = {
            flatten_cname = false
        }
        tags        = []
        ttl         = 1
        type        = "CNAME"
        zone_id     = "7f483b9c99ee9e16c695471be9036b4f"
    }

  # cloudflare_pages_domain.website will be updated in-place
  # (imported from "2893a9667da2abc314f81440d2513fc5/reinhardt-web/reinhardt-web.dev")
  ~ resource "cloudflare_pages_domain" "website" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ account_id            = (sensitive value)
        certificate_authority = "lets_encrypt"
        created_on            = "2026-02-23T09:38:42.919404Z"
        domain_id             = "17072900-80a4-4f6d-bf9a-39fb57f104f1"
        id                    = "reinhardt-web.dev"
        name                  = "reinhardt-web.dev"
        project_name          = "reinhardt-web"
        status                = "active"
        validation_data       = {
            method = "http"
            status = "active"
        }
        verification_data     = {
            status = "active"
        }
        zone_tag              = "7f483b9c99ee9e16c695471be9036b4f"
    }

  # cloudflare_pages_project.website will be updated in-place
  # (imported from "2893a9667da2abc314f81440d2513fc5/reinhardt-web")
  ~ resource "cloudflare_pages_project" "website" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ account_id             = (sensitive value)
        canonical_deployment   = {
            aliases            = [
                "https://reinhardt-web.dev",
            ]
            build_config       = {}
            created_on         = "2026-03-14T04:28:39Z"
            deployment_trigger = {
                metadata = {
                    branch         = "main"
                    commit_dirty   = true
                    commit_hash    = "c2236e773a0e6f8270599cc3934faf8359610823"
                    commit_message = <<-EOT
                        Merge pull request #2222 from kent8192/feat/remove-external-validator
                        
                        feat!(core): replace external validator crate with built-in validation system
                    EOT
                }
                type     = "ad_hoc"
            }
            env_vars           = {}
            environment        = "production"
            id                 = "b3c4953f-3311-4db3-85ae-25a49b9de06d"
            is_skipped         = false
            latest_stage       = {
                ended_on = "2026-03-14T04:28:42Z"
                name     = "deploy"
                status   = "success"
            }
            modified_on        = "2026-03-14T04:28:42Z"
            project_id         = "a3c84fd9-9bbb-40c1-8afe-5bbc5e35a802"
            project_name       = "reinhardt-web"
            short_id           = "b3c4953f"
            stages             = [
                {
                    name       = "queued"
                    started_on = "2026-03-14T04:28:39Z"
                    status     = "active"
                },
                {
                    name   = "initialize"
                    status = "idle"
                },
                {
                    name   = "clone_repo"
                    status = "idle"
                },
                {
                    name   = "build"
                    status = "idle"
                },
                {
                    ended_on = "2026-03-14T04:28:42Z"
                    name     = "deploy"
                    status   = "success"
                },
            ]
            url                = "https://b3c4953f.reinhardt-web.pages.dev"
            uses_functions     = false
        }
        created_on             = "2026-02-23T09:38:40Z"
        deployment_configs     = {
            preview    = {
                always_use_latest_compatibility_date = false
                build_image_major_version            = 3
                compatibility_date                   = "2026-02-23"
                fail_open                            = true
                usage_model                          = "standard"
            }
            production = {
                always_use_latest_compatibility_date = false
                build_image_major_version            = 3
                compatibility_date                   = "2026-02-23"
                fail_open                            = true
                usage_model                          = "standard"
            }
        }
        domains                = [
            "reinhardt-web.pages.dev",
            "reinhardt-web.dev",
        ]
        framework              = ""
        framework_version      = ""
        id                     = "reinhardt-web"
        latest_deployment      = {
            aliases            = [
                "https://reinhardt-web.dev",
            ]
            build_config       = {}
            created_on         = "2026-03-14T04:28:39Z"
            deployment_trigger = {
                metadata = {
                    branch         = "main"
                    commit_dirty   = true
                    commit_hash    = "c2236e773a0e6f8270599cc3934faf8359610823"
                    commit_message = <<-EOT
                        Merge pull request #2222 from kent8192/feat/remove-external-validator
                        
                        feat!(core): replace external validator crate with built-in validation system
                    EOT
                }
                type     = "ad_hoc"
            }
            env_vars           = {}
            environment        = "production"
            id                 = "b3c4953f-3311-4db3-85ae-25a49b9de06d"
            is_skipped         = false
            latest_stage       = {
                ended_on = "2026-03-14T04:28:42Z"
                name     = "deploy"
                status   = "success"
            }
            modified_on        = "2026-03-14T04:28:42Z"
            project_id         = "a3c84fd9-9bbb-40c1-8afe-5bbc5e35a802"
            project_name       = "reinhardt-web"
            short_id           = "b3c4953f"
            stages             = [
                {
                    name       = "queued"
                    started_on = "2026-03-14T04:28:39Z"
                    status     = "active"
                },
                {
                    name   = "initialize"
                    status = "idle"
                },
                {
                    name   = "clone_repo"
                    status = "idle"
                },
                {
                    name   = "build"
                    status = "idle"
                },
                {
                    ended_on = "2026-03-14T04:28:42Z"
                    name     = "deploy"
                    status   = "success"
                },
            ]
            url                = "https://b3c4953f.reinhardt-web.pages.dev"
            uses_functions     = false
        }
        name                   = "reinhardt-web"
        preview_script_name    = "pages-worker--11212537-preview"
        production_branch      = "main"
        production_script_name = "pages-worker--11212537-production"
        subdomain              = "reinhardt-web.pages.dev"
        uses_functions         = false
    }

  # github_actions_secret.cloudflare_account_id will be created
  + resource "github_actions_secret" "cloudflare_account_id" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "reinhardt-web"
      + repository_id     = (known after apply)
      + secret_name       = "CLOUDFLARE_ACCOUNT_ID"
      + updated_at        = (known after apply)
    }

  # github_actions_secret.cloudflare_api_token will be created
  + resource "github_actions_secret" "cloudflare_api_token" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "reinhardt-web"
      + repository_id     = (known after apply)
      + secret_name       = "CLOUDFLARE_API_TOKEN"
      + updated_at        = (known after apply)
    }

  # github_actions_secret.tf_plan_cloudflare_account_id will be created
  + resource "github_actions_secret" "tf_plan_cloudflare_account_id" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "reinhardt-web"
      + repository_id     = (known after apply)
      + secret_name       = "TF_CLOUDFLARE_ACCOUNT_ID"
      + updated_at        = (known after apply)
    }

  # github_actions_secret.tf_plan_cloudflare_api_token will be created
  + resource "github_actions_secret" "tf_plan_cloudflare_api_token" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "reinhardt-web"
      + repository_id     = (known after apply)
      + secret_name       = "TF_CLOUDFLARE_API_TOKEN"
      + updated_at        = (known after apply)
    }

  # github_actions_secret.tf_plan_custom_domain will be created
  + resource "github_actions_secret" "tf_plan_custom_domain" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "reinhardt-web"
      + repository_id     = (known after apply)
      + secret_name       = "TF_CUSTOM_DOMAIN"
      + updated_at        = (known after apply)
    }

  # github_actions_secret.tf_plan_dns_record_apex_id will be created
  + resource "github_actions_secret" "tf_plan_dns_record_apex_id" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "reinhardt-web"
      + repository_id     = (known after apply)
      + secret_name       = "TF_DNS_RECORD_APEX_ID"
      + updated_at        = (known after apply)
    }

  # github_actions_secret.tf_plan_dns_record_google_verification_id will be created
  + resource "github_actions_secret" "tf_plan_dns_record_google_verification_id" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "reinhardt-web"
      + repository_id     = (known after apply)
      + secret_name       = "TF_DNS_RECORD_GOOGLE_VERIFICATION_ID"
      + updated_at        = (known after apply)
    }

  # github_actions_secret.tf_plan_dns_record_www_id will be created
  + resource "github_actions_secret" "tf_plan_dns_record_www_id" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "reinhardt-web"
      + repository_id     = (known after apply)
      + secret_name       = "TF_DNS_RECORD_WWW_ID"
      + updated_at        = (known after apply)
    }

  # github_actions_secret.tf_plan_github_repository will be created
  + resource "github_actions_secret" "tf_plan_github_repository" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "reinhardt-web"
      + repository_id     = (known after apply)
      + secret_name       = "TF_GITHUB_REPOSITORY"
      + updated_at        = (known after apply)
    }

  # github_actions_secret.tf_plan_github_token will be created
  + resource "github_actions_secret" "tf_plan_github_token" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "reinhardt-web"
      + repository_id     = (known after apply)
      + secret_name       = "TF_GITHUB_TOKEN"
      + updated_at        = (known after apply)
    }

  # github_actions_secret.tf_plan_google_site_verification will be created
  + resource "github_actions_secret" "tf_plan_google_site_verification" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "reinhardt-web"
      + repository_id     = (known after apply)
      + secret_name       = "TF_GOOGLE_SITE_VERIFICATION"
      + updated_at        = (known after apply)
    }

  # github_actions_secret.tf_plan_pages_project_name will be created
  + resource "github_actions_secret" "tf_plan_pages_project_name" {
      + created_at        = (known after apply)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + plaintext_value   = (sensitive value)
      + remote_updated_at = (known after apply)
      + repository        = "reinhardt-web"
      + repository_id     = (known after apply)
      + secret_name       = "TF_PAGES_PROJECT_NAME"
      + updated_at        = (known after apply)
    }

Plan: 5 to import, 12 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + custom_domain      = "reinhardt-web.dev"
  + pages_project_name = "reinhardt-web"
  + pages_subdomain    = "reinhardt-web.pages.dev"
  + zone_id            = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>